import{_ as n,o as p,c as a,a as t}from"./app-a2b6e588.js";const e={},o=t(`<h1 id="职场见闻录" tabindex="-1"><a class="header-anchor" href="#职场见闻录" aria-hidden="true">#</a> 职场见闻录</h1><ul><li><a href="#cto1">职场见闻录(一) - 怎样回答这两个问题？</a></li><li><a href="#cto2">职场见闻录(二) – 与顶级CTO交手的难忘经验...</a></li><li><a href="#cto3">职场见闻录(三) - 与女大学生的网络对话(上)</a></li></ul><h2 id="职场见闻录-一-怎样回答这两个问题" tabindex="-1"><a class="header-anchor" href="#职场见闻录-一-怎样回答这两个问题" aria-hidden="true">#</a> <a id="cto1">职场见闻录(一) - 怎样回答这两个问题？</a></h2><p>由于工作经历的缘故，使我有一些面试别人的机会，我在传播是24年、金融是16年、IT行业比较短是14年，所以应该还有一些经验可以跟大家聊聊。</p><p>当我们提到“面试” 这个词，总是让人有种阶级感，好像面试官就是高高在上，而面试者则是屈居于下，其实并非如此，当一家公司面试你的时候，你同时也在面试这家公司，尽管面试过程要正经，但不需要太紧张，因为一个面试官如果真有那样的功力，他应该能够察觉出你的潜力，就像从一堆沙里挑出黄金。</p><p>以前我面试的时候经常问两个问题:</p><ol><li>你从小到大遭遇最大的困难或障碍是什么?</li><li>最后你是如何去解决的?</li></ol><p>当回答第一题时，我得想办法从你的描述，读出你的过去、你的成长环境和你的个性；而当你讲出困难时，我会先在心里琢磨如果碰到一样的问题，该怎么办？然后比较我们做法的差距，以便决定如果将来你进公司，应该把你摆在哪个位置上。</p><p>对于第一题，毕竟每个人的成长都不相同，所以没有标准答案，有些人会告诉我:“好像没有碰到过什么不能解决的问题”，很显然，他没有了解问的问题，因为不是问“有没有碰到不能解决的问题”，而是问“碰到过最大的问题”。</p><p>还有人会说: “还好 ~ 没遇过什么困难”，没有什么困难?! 你相信吗? 这很可能是一个没有历史的人，即使真的有过什么困难，恐怕他也不曾去记住。</p><p>最好的答案是有一段记忆，不需要编造，自然平静的描述，听的人可以感受整个的你。</p><p>当然我也有过到公司应征的经验，你也别放弃面试这家公司的机会，通常面试我的人问完问题后，我也会问这间公司两个问题:</p><ol><li>听说贵公司人才济济，不知都有哪些人才?</li><li>请问这些人在公司待多久了? 还会继续待多久?</li></ol><p>当我问第一题的时候，是想知道面试者到底对自己公司了解不了解，我不骗你，即使很多大公司，第一题都未必能够答的出来，而我们又怎么能待在一家不了解自己员工的公司呢?</p><p>第二题问的是现有员工对工作以及现况的忠诚度，从第二题答案就可以窥视很多秘密，资深员工非常重要，这使我们能在钞票以外拥有工作的尊严(请参考我的另外一篇文章 – 工作的尊严)，我乐于向这些前辈靠近并学习。但如果这些人的任期都很短，有些人甚至在未来的日子里就准备走人，你怎么想?</p><p>下一篇我将和你分享我在面试过程中的经典际遇…</p><h2 id="职场见闻录-二-–-与顶级cto交手的难忘经验" tabindex="-1"><a class="header-anchor" href="#职场见闻录-二-–-与顶级cto交手的难忘经验" aria-hidden="true">#</a> <a id="cto2">职场见闻录(二) – 与顶级CTO交手的难忘经验...</a></h2><p>大部分面试都是寻找团队伙伴或成员，很少是面试高层，因为职级比我们高的人，自然会有更高层的人面试他们，但这次分享的不是一般面试，而是我跟顶级CTO交手的经验，尽管为了顾虑当事人隐私，我已经隐去很多名字，但它却是真实发生的故事…</p><p>1995年，互联网风起云涌，特别是1996 – 1998年这段时间，正是 .com 最疯狂的年代，市场上永远都有一堆钱，不知道往哪里烧、往哪里放，如果说工作职级像座金字塔，那么我们头上永远都有人在监督着… 总经理上面有董事长、董事长上面有董事会，然后是股东，股东还要面对普罗大众及市场。</p><p>在技术这一块，最顶层的应该是技术总监了，但大家有没有想过谁来面试技术总监(CTO)呢?</p><p>我们熟知的那些大企业，即使包括微软、IBM、HP… 在内，高层工作或职务很少是经由登报应聘的，反而大多都是经由猎头或在很小的圈子里传播，决定过程可以很短也可能很长，就像某些高层回忆录所写的一样，有时甚至短到只是一通电话：“XXX想找你聊一聊，不知你有没有时间…”</p><p>当然，我们这次聊的不是我去面试碰到了CTO，而是我面试CTO的难忘经验...</p><p>这是在某天的深夜，我接到了一通电话，是一家台资企业公司的老板，这家公司是比尔盖兹1993年访台时，点名台湾几个最有潜力软件公司的一家，我们姑且称当事人为X董。</p><p>X董告诉我明天有人从国外回台要面试CTO，年薪过百万，对方技术很强，希望我帮他看看。</p><p>我询问了相关细节，啊... 是Java平台，在某些领域已经有了一些专利，还是个博士... 在美国待过一些研究机构，参与不少项目，这个点点点，那个点点点，大致如此。</p><p>为什么找我面试? 这实在有点奇怪，Java又不是我的专长。是的，正因为不是我的专长，所以你可以想象面试的过程是什么模样。</p><p>原来，X董找我去只是基于: 我是他十年的邻居兼好友，我非常了解他，一起喝酒、一起玩，了解他很多事情，他的创业起步，他的快乐痛苦，从婚姻到家庭以及点点点，所以我最终还是答应去会会这个高手了，或许也是一种学习的机会吧。</p><p>那是某天下午，我进入这间公司金碧辉煌的会议室，进去以后，发现人已经到了，不仅如此，还有不少报上经常看到产、官、学术界的人都准备来会会这位大侠，啊... 真新鲜，算是开眼了，面试开始以后，就像研究所博士生答辩那样，看着其他专家轮番上阵问他很多技术方面的问题，他也算是真有一定的实力和工作经验了。</p><p>最后轮到我发问了，我是最后一个，我该问他什么呢？面对一个技术经验如此丰富的人...</p><p>我终于知道要问他什么了，在请X董助理拿来水果刀后，我站起身，拾起随身带的一袋苹果</p><p>“大家都辛苦了，面试这么久，不如请X兄削个苹果，轻松轻松吧...”</p><p>从这位老兄接过苹果、拿刀的姿势、削苹果的方法、角度和快慢... 我就开始用我的磁场包住他的磁场，感觉他的整个状态，他的过去、他的个性和一切，最后，我终于明白我出现在这间会议室的理由，面试这样的高人，是不能从表象找答案的，我的目的并不是考倒或难倒他，而是发现并了解他。</p><p>X董找我来是因为我们彼此了解，<strong>我是在帮他找一个最适合他的人，而不是一个最完美的人</strong>，大多数时候我们认为技术与能力代表一切，实际上这是不正确的，否则那些大公司也就不会有那么多高层在舞台上来来去去了。</p><p>用眼睛看事情和用心感受确实不同，我们认为错的表象，后面很可能都存在一些容易被人忽略的原因，就像喜欢或讨厌某个人往往只是因为某件事，当用心去探索真相时，怜悯、包容和宽恕就会照见许多真实的故事及历史了。</p><p>故事的结局是我认为他不适合待在这家公司，他可以有更好的发展，而其他面试官认为适合，X 董接受了多数人的意见，还是决定任用他。两年以后... 他离开这家公司，继续他个人未完的职场生涯，该技术部门解体，公司亏损两千万，一切就像昨日，现在我回台北碰见X董，俩人聊及往事，还是不胜唏嘘...</p><h2 id="职场见闻录-三-与女大学生的网络对话-上" tabindex="-1"><a class="header-anchor" href="#职场见闻录-三-与女大学生的网络对话-上" aria-hidden="true">#</a> <a id="cto3">职场见闻录(三) - 与女大学生的网络对话(上)</a></h2><p>&quot;面试&quot; 顾名思义是 &quot;见面以后的试探&quot;，但有时你未必会见到真正关键的人物，我们必须理解的是对方并不是故做姿态或故弄玄虚躲在暗处，而是可能真的太忙了，今天在这个国家，明天又飞到另外一个城市，所以他们可能通过电话，MSN 或是 QQ 来面试你.</p><p>对招聘方而言，没有见面的面试有好有坏，好处是招聘方不会受到外表干扰，而更能感受许多容易疏忽的事情. 以下是一个 QQ 面试的真实全过程，与女大学生的网络对话...</p><p>我们将分成几次来介绍，我隐藏了对话过程的关键姓名，因为那不重要，重点是我们在面试过程里，别人会问些什么? 关心什么? 其中批注的部分写在最后提供参考</p><div class="language-txt" data-ext="txt"><pre class="language-txt"><code>用户：所有分组(QQ好友)
==================================================
消息类型：聊天记录
==================================================
--------------------------------------------------
消息对象：求职方：(00000000)
--------------------------------------------------
求职方：OO你好，我是XX，应聘美工
招聘方：hi，您好，你是几年生? 有简历吗(注一)? 
求职方：我是84年生的，我有作品，简历没有
招聘方：你工作几年了? 哪里可以看到你的作品? 你有放到网站上吗? 
求职方：我今年毕业，在学校有做过兼职，我传给您吧
招聘方：好的 
求职方：作品现在这边电脑上，您需要哪方面的？因为比较多 
招聘方：[:O] 
求职方：[;-D]，昨天传过，挺慢的
招聘方：你自己有网站吗? 就是关于介绍你自己的网站? 例如: 博客或者是其它? (注二)
求职方：没有 
招聘方：你觉得可以让我怎样了解你? 
求职方：我先发些作品给你看，然后我可以简短的做个自我介绍，最后一张是我的手绘作品
招聘方：你一共传过两三张对吗? 你平常上 qq 吗? 
求职方：现在传不过去，电脑没有上网，不好意思(注三)
招聘方：接收文件保存于 C:\\Documents and Settings\\application\\2.bmp(注四)
求职方：有点慢，先传完这几张，我再继续
招聘方：你学过印刷输出吗? 
求职方：您是说印刷流程吗 ？ 
招聘方：像 CMYK 制版分色 
求职方：如果是的话，我学过，而且现在我就在出版社做相关工作，是的，我有学过，哦，我该先做下自我介绍的 ，
招聘方：你熟悉哪些软件? 
求职方：我的专业是视觉传达，我主攻平面设计，PHOTOSHOP COWERAL PAGEMAKE FLASH 3DMAX了解 
招聘方：哪一所学校啊? 有没有平面设计的印刷作品? (注五)
求职方：XX学院，您是说，书籍方面的东西吗 
招聘方：宣传单也可以，或者是书的封面设计 
求职方：有的 
招聘方：这样吧，你写一个简单的履历，你看看你会怎样设计，然后上面也有你的简单介绍，弄好以后寄给我: xxxapply@hotmail.com (注六)
招聘方：你看这样可以吗? 
求职方：好的，没问题 
招聘方：那就先这样了，尽快喔 
求职方：好的好的 ，
----(第二天)----------------------------------------------------
求职方：OO还在吗  
招聘方：hi，在啊 
求职方：OO，不好意思，昨天这边下班了，所以我走了 
招聘方：喔... 你现在人在哪里? 还在公司? 
求职方：OO，不好意思，昨天这边下班了，所以我走了 
招聘方：or...? 
招聘方：人又不见了? [?] 
求职方：这边发不出去[:~] 
招聘方：你现在在哪里? 
求职方：我现在XXXX公司里
招聘方：那边的网络环境看起来有点问题(注七) 
求职方：[:)]希望一切都会更好，OO，这几天一直没有机会跟你好好谈谈，是我的疏忽，希望您能见谅，请给我个机会，从新自我介绍
招聘方：没有问题，你吃过饭了吗? (注八) 
求职方：作品图，昨天MICHAEL给您发的可能太大了，10分钟以后我从新发给您可以吗
招聘方：我现在要先去吃饭了，你可以先发到我的信箱，然后晚点我回来看 
求职方：好的
招聘方：[;-D] 
求职方：您的邮箱是？ 
招聘方：xxxapply@hotmail.com，OK? 
求职方：收到，请给我机会从新认识我
招聘方：ok 
求职方：谢谢，您去吃饭吧，作品已经发到您邮箱里，收到请给我留言，谢谢
招聘方：好的 
求职方：期待您的指教
招聘方：你发到哪个信箱? 
求职方：xxxapply@hotmail.com，您刚给我的这个 
招聘方：收到了，正在下载 
求职方：[:&lt;]太激动了
</code></pre></div><hr><p>注一: 在第一句话，让对方了解以下的事情:</p><div class="language-txt" data-ext="txt"><pre class="language-txt"><code>　　你的性别(先生? Or 小姐?)
　　年龄 (部分工作有年龄的限制…)
　　来自何处(ex: 我是山东人，但现在在浙江工作)
　　应征的职务
</code></pre></div><p>注二: 网络应征的时间不会很长，等待对面试的过程不利，如果可能，最好有自己的网站或博客，你可以在上面抒发心情或摆放作品，这比单纯的简历更能协助招聘方对你的了解.</p><p>注三: 要让对方知道如何及时联系你，MSN，qq 或任何实时通讯工具都是重要的，特别是在你面试找工作这段期间，如果可能最好两者都有，或询问对方使用的实时通讯工具，配合适应.</p><p>注四: 任何图形都使用 jpg 传递，不要使用 bmp，应且确保你的文件大小尺寸经过适当压缩，理想上一张图不要超过 200 K. 给对方的东西如果十几MB或者是几十MB都太大了，对一个每天需要面试几十人，甚至上百人的招聘方，他很可能没有那样的耐心.</p><p>注五: 当人家问你学校时只是作为参考，好的学校当然可以加分，如果不是很好学校毕业的，那么你要有很好的作品，并且在一开始就要让对方了解这件事情，一但别人问到你的学校时，通常都是他从你的作品感觉不到他要的东西，或者根本看不到你的作品. 仔细想想我个这句话… 如果你在第一时间已经让对方看出你的才华，小学没有毕业我也会要，管你是不是北大，清大，有没有毕业，从农村来也一样.</p><p>紧跟着学校后面的那个问题，不一定是将来工作内容，通常是想了解你在专业领域的宽广度.</p><p>注六: 招聘方有可能临时出题，所以拿别人作品面试是很危险的，不要干这种事情，真的东西假不了，假的东西真不了. 很多面试现场考编程的，立马就会让你在白板上面写一段代码，如果只会使用编程工具的关键词自动完成，连英文单词都拼错，只能希望老天爷保佑了.</p><p>注七: 不要让网络问题干扰你的面试，找最稳定的环境去对话，否则很难留下好的印象.</p><p>注八: 不要在快吃饭时进行面试，避开一些关键时间，或是你可以先写一封信寄到对方的信箱</p><hr><p>对话还没有完全结束，我要出差，过两天回来再继续写</p>`,53),i=[o];function c(l,r){return p(),a("div",null,i)}const h=n(e,[["render",c],["__file","cto15.html.vue"]]);export{h as default};
